
const unitList = [
    {
        kuni: "リトス",
        name: "主人公",
        seityouritu: {HP: 60, 力: 35, 魔力: 20, 技: 45, 速さ: 50, 守備: 40, 魔防: 25, 幸運: 25, 体格: 5, 合計: 305},
    },
    {
        kuni: "リトス",
        name: "ヴァンドレ",
        seityouritu: {HP: 60, 力: 25, 魔力: 10, 技: 25, 速さ: 35, 守備: 35, 魔防: 20, 幸運: 10, 体格: 5, 合計: 225},
    },
    {
        kuni: "リトス",
        name: "クラン",
        seityouritu: {HP: 40, 力: 35, 魔力: 10, 技: 40, 速さ: 50, 守備: 30, 魔防: 25, 幸運: 20, 体格: 5, 合計: 255},
    },
    {
        kuni: "リトス",
        name: "フラン",
        seityouritu: {HP: 55, 力: 30, 魔力: 25, 技: 35, 速さ: 55, 守備: 25, 魔防: 30, 幸運: 25, 体格: 0, 合計: 280},
    },
    {
        kuni: "フィレネ",
        name: "アルフレッド",
        seityouritu: {HP: 65, 力: 40, 魔力: 5, 技: 35, 速さ: 40, 守備: 40, 魔防: 20, 幸運: 40, 体格: 10, 合計: 295},
    },
    {
        kuni: "フィレネ",
        name: "セリーヌ",
        seityouritu: {HP: 50, 力: 35, 魔力: 25, 技: 30, 速さ: 45, 守備: 30, 魔防: 40, 幸運: 50, 体格: 5, 合計: 310},
    },
    {
        kuni: "フィレネ",
        name: "ブシュロン",
        seityouritu: {HP: 85, 力: 20, 魔力: 0, 技: 50, 速さ: 45, 守備: 35, 魔防: 20, 幸運: 15, 体格: 20, 合計: 290},
    },
    {
        kuni: "フィレネ",
        name: "エーティエ",
        seityouritu: {HP: 45, 力: 40, 魔力: 0, 技: 25, 速さ: 35, 守備: 25, 魔防: 30, 幸運: 25, 体格: 5, 合計: 230},
    },
    {
        kuni: "フィレネ",
        name: "ルイ",
        seityouritu: {HP: 75, 力: 40, 魔力: 0, 技: 25, 速さ: 25, 守備: 50, 魔防: 20, 幸運: 25, 体格: 15, 合計: 275},
    },
    {
        kuni: "フィレネ",
        name: "クロエ",
        seityouritu: {HP: 75, 力: 25, 魔力: 35, 技: 40, 速さ: 55, 守備: 30, 魔防: 25, 幸運: 25, 体格: 5, 合計: 315},
    },
    {
        kuni: "フィレネ",
        name: "ジャン",
        seityouritu: {HP: 50, 力: 20, 魔力: 20, 技: 35, 速さ: 40, 守備: 25, 魔防: 20, 幸運: 25, 体格: 5, 合計: 240},
    },
    {
        kuni: "ブロディア",
        name: "ディアマンド",
        seityouritu: {HP: 75, 力: 30, 魔力: 15, 技: 20, 速さ: 40, 守備: 40, 魔防: 25, 幸運: 20, 体格: 15, 合計: 280},
    },
    {
        kuni: "ブロディア",
        name: "スタルーク",
        seityouritu: {HP: 65, 力: 30, 魔力: 10, 技: 40, 速さ: 45, 守備: 30, 魔防: 20, 幸運: 15, 体格: 10, 合計: 265},
    },
    {
        kuni: "ブロディア",
        name: "アンバー",
        seityouritu: {HP: 65, 力: 45, 魔力: 0, 技: 25, 速さ: 30, 守備: 35, 魔防: 5, 幸運: 35, 体格: 15, 合計: 255},
    },
    {
        kuni: "ブロディア",
        name: "ジェーデ",
        seityouritu: {HP: 55, 力: 35, 魔力: 25, 技: 35, 速さ: 30, 守備: 40, 魔防: 30, 幸運: 20, 体格: 10, 合計: 280},
    },
    {
        kuni: "ブロディア",
        name: "ラピス",
        seityouritu: {HP: 55, 力: 25, 魔力: 20, 技: 35, 速さ: 55, 守備: 35, 魔防: 30, 幸運: 25, 体格: 5, 合計: 285},
    },
    {
        kuni: "ブロディア",
        name: "シトリニカ",
        seityouritu: {HP: 45, 力: 10, 魔力: 40, 技: 25, 速さ: 30, 守備: 20, 魔防: 40, 幸運: 25, 体格: 5, 合計: 240},
    },
    {
        kuni: "ブロディア",
        name: "ユナカ",
        seityouritu: {HP: 50, 力: 35, 魔力: 25, 技: 40, 速さ: 45, 守備: 15, 魔防: 45, 幸運: 25, 体格: 5, 合計: 285},
    },
    {
        kuni: "ブロディア",
        name: "ザフィーア",
        seityouritu: {HP: 80, 力: 35, 魔力: 0, 技: 25, 速さ: 30, 守備: 30, 魔防: 5, 幸運: 20, 体格: 10, 合計: 235},
    },
    {
        kuni: "イルシオン",
        name: "アイビー",
        seityouritu: {HP: 55, 力: 25, 魔力: 30, 技: 25, 速さ: 40, 守備: 30, 魔防: 35, 幸運: 15, 体格: 10, 合計: 265},
    },
    {
        kuni: "イルシオン",
        name: "オルテンシア",
        seityouritu: {HP: 40, 力: 20, 魔力: 20, 技: 35, 速さ: 50, 守備: 25, 魔防: 55, 幸運: 50, 体格: 0, 合計: 295},
    },
    {
        kuni: "イルシオン",
        name: "ゼルコバ",
        seityouritu: {HP: 65, 力: 35, 魔力: 15, 技: 40, 速さ: 35, 守備: 35, 魔防: 15, 幸運: 25, 体格: 10, 合計: 275},
    },
    {
        kuni: "イルシオン",
        name: "カゲツ",
        seityouritu: {HP: 60, 力: 30, 魔力: 15, 技: 50, 速さ: 50, 守備: 40, 魔防: 25, 幸運: 40, 体格: 10, 合計: 320},
    },
    {
        kuni: "イルシオン",
        name: "ロサード",
        seityouritu: {HP: 75, 力: 45, 魔力: 25, 技: 40, 速さ: 45, 守備: 30, 魔防: 30, 幸運: 20, 体格: 5, 合計: 315},
    },
    {
        kuni: "イルシオン",
        name: "ゴルドマリー",
        seityouritu: {HP: 65, 力: 30, 魔力: 5, 技: 25, 速さ: 25, 守備: 55, 魔防: 25, 幸運: 25, 体格: 5, 合計: 260},
    },
    {
        kuni: "イルシオン",
        name: "アンナ",
        seityouritu: {HP: 55, 力: 15, 魔力: 50, 技: 50, 速さ: 50, 守備: 20, 魔防: 35, 幸運: 45, 体格: 5, 合計: 325},
    },
    {
        kuni: "イルシオン",
        name: "リンデン",
        seityouritu: {HP: 65, 力: 25, 魔力: 25, 技: 25, 速さ: 40, 守備: 25, 魔防: 40, 幸運: 15, 体格: 10, 合計: 270},
    },
    {
        kuni: "ソルム",
        name: "ミスティラ",
        seityouritu: {HP: 55, 力: 25, 魔力: 25, 技: 45, 速さ: 45, 守備: 30, 魔防: 30, 幸運: 30, 体格: 10, 合計: 295},
    },
    {
        kuni: "ソルム",
        name: "フォガート",
        seityouritu: {HP: 60, 力: 30, 魔力: 25, 技: 30, 速さ: 55, 守備: 30, 魔防: 35, 幸運: 25, 体格: 10, 合計: 300},
    },
    {
        kuni: "ソルム",
        name: "メリン",
        seityouritu: {HP: 55, 力: 25, 魔力: 25, 技: 40, 速さ: 50, 守備: 30, 魔防: 30, 幸運: 25, 体格: 10, 合計: 290},
    },
    {
        kuni: "ソルム",
        name: "パネトネ",
        seityouritu: {HP: 75, 力: 45, 魔力: 10, 技: 40, 速さ: 25, 守備: 30, 魔防: 15, 幸運: 20, 体格: 15, 合計: 275},
    },
    {
        kuni: "ソルム",
        name: "パンドロ",
        seityouritu: {HP: 60, 力: 5, 魔力: 30, 技: 45, 速さ: 45, 守備: 15, 魔防: 55, 幸運: 30, 体格: 15, 合計: 300},
    },
    {
        kuni: "ソルム",
        name: "ボネ",
        seityouritu: {HP: 65, 力: 30, 魔力: 10, 技: 40, 速さ: 35, 守備: 45, 魔防: 25, 幸運: 40, 体格: 10, 合計: 300},
    },
    {
        kuni: "ソルム",
        name: "セアダス",
        seityouritu: {HP: 55, 力: 25, 魔力: 15, 技: 25, 速さ: 50, 守備: 25, 魔防: 25, 幸運: 35, 体格: 10, 合計: 265},
    },
    {
        kuni: "その他",
        name: "ヴェイル",
        seityouritu: {HP: 40, 力: 25, 魔力: 45, 技: 35, 速さ: 30, 守備: 25, 魔防: 35, 幸運: 20, 体格: 0, 合計: 255},
    },
    {
        kuni: "その他",
        name: "モーヴ",
        seityouritu: {HP: 70, 力: 35, 魔力: 40, 技: 40, 速さ: 35, 守備: 50, 魔防: 45, 幸運: 15, 体格: 15, 合計: 345},
    },
    {
        kuni: "DLC",
        name: "エル",
        seityouritu: {HP: 55, 力: 30, 魔力: 25, 技: 40, 速さ: 45, 守備: 30, 魔防: 35, 幸運: 30, 体格: 10, 合計: 300},
    },
    {
        kuni: "DLC",
        name: "ラファール",
        seityouritu: {HP: 70, 力: 40, 魔力: 10, 技: 40, 速さ: 35, 守備: 45, 魔防: 20, 幸運: 10, 体格: 10, 合計: 280},
    },
    {
        kuni: "DLC",
        name: "セレスティア",
        seityouritu: {HP: 60, 力: 35, 魔力: 35, 技: 35, 速さ: 50, 守備: 30, 魔防: 35, 幸運: 20, 体格: 5, 合計: 305},
    },
    {
        kuni: "DLC",
        name: "グレゴリー",
        seityouritu: {HP: 55, 力: 30, 魔力: 50, 技: 20, 速さ: 25, 守備: 35, 魔防: 50, 幸運: 25, 体格: 5, 合計: 295},
    },
    {
        kuni: "DLC",
        name: "マデリーン",
        seityouritu: {HP: 75, 力: 50, 魔力: 20, 技: 15, 速さ: 15, 守備: 55, 魔防: 25, 幸運: 25, 体格: 10, 合計: 290},
    },
];

const kihonHeisyuList = [
    {
        name: "ソードマスター",
        isDlc: false,
    },
    {
        name: "ブレイブヒーロー",
        isDlc: false,
    },
    {
        name: "ハルバーディア",
        isDlc: false,
    },
    {
        name: "ロイヤルナイト",
        isDlc: false,
    },
    {
        name: "ベルセルク",
        isDlc: false,
    },
    {
        name: "ウォーリアー",
        isDlc: false,
    },
    {
        name: "スナイパー",
        isDlc: false,
    },
    {
        name: "ボウナイト",
        isDlc: false,
    },
    {
        name: "ジェネラル",
        isDlc: false,
    },
    {
        name: "グレートナイト",
        isDlc: false,
    },
    {
        name: "パラディン",
        isDlc: false,
    },
    {
        name: "ウルフナイト",
        isDlc: false,
    },
    {
        name: "グリフォンナイト",
        isDlc: false,
    },
    {
        name: "ドラゴンナイト",
        isDlc: false,
    },
    {
        name: "セイジ",
        isDlc: false,
    },
    {
        name: "マージナイト",
        isDlc: false,
    },
    {
        name: "マスターモンク",
        isDlc: false,
    },
    {
        name: "ハイプリースト",
        isDlc: false,
    },
    {
        name: "シーフ",
        isDlc: false,
    },
    {
        name: "エンチャント",
        isDlc: true,
    },
    {
        name: "マージカノン",
        isDlc: true,
    },
];

const senyouHeisyuList = [
    {
        name: "神竜ノ王",
        isDlc: false,
    },
    {
        name: "アヴニール",
        isDlc: false,
    },
    {
        name: "フロラージュ",
        isDlc: false,
    },
    {
        name: "スュクセサール",
        isDlc: false,
    },
    {
        name: "ティラユール",
        isDlc: false,
    },
    {
        name: "リンドブルム",
        isDlc: false,
    },
    {
        name: "スレイプニル",
        isDlc: false,
    },
    {
        name: "ピッチフォーク",
        isDlc: false,
    },
    {
        name: "クピードー",
        isDlc: false,
    },
    {
        name: "ダンサー",
        isDlc: false,
    },
    {
        name: "邪竜ノ娘(ヴェイル)",
        isDlc: false,
    },
    {
        name: "邪竜ノ娘(エル)",
        isDlc: true,
    },
    {
        name: "邪竜ノ子",
        isDlc: true,
    },
    {
        name: "メリュジーヌ",
        isDlc: true,
    },
];

