
const unitList = [
    {
        kuni: "リトス",
        name: "主人公",
        seityouritu: {HP: 60, 力: 35, 魔力: 20, 技: 45, 速さ: 50, 守備: 40, 魔防: 25, 幸運: 25, 体格: 5, 合計: 305},
        jougenti: {HP: 0, 力: 1, 魔力: 0, 技: 1, 速さ: 1, 守備: 0, 魔防: 0, 幸運: 0, 体格: 0, 合計: 3},
    },
    {
        kuni: "リトス",
        name: "ヴァンドレ",
        seityouritu: {HP: 60, 力: 25, 魔力: 10, 技: 25, 速さ: 35, 守備: 35, 魔防: 20, 幸運: 10, 体格: 5, 合計: 225},
        jougenti: {HP: 0, 力: 1, 魔力: -1, 技: 1, 速さ: -2, 守備: 3, 魔防: -2, 幸運: 0, 体格: 0, 合計: 0},
    },
    {
        kuni: "リトス",
        name: "クラン",
        seityouritu: {HP: 40, 力: 35, 魔力: 10, 技: 40, 速さ: 50, 守備: 30, 魔防: 25, 幸運: 20, 体格: 5, 合計: 255},
        jougenti: {HP: 0, 力: 1, 魔力: -1, 技: 2, 速さ: 2, 守備: -2, 魔防: -1, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "リトス",
        name: "フラン",
        seityouritu: {HP: 55, 力: 30, 魔力: 25, 技: 35, 速さ: 55, 守備: 25, 魔防: 30, 幸運: 25, 体格: 0, 合計: 280},
        jougenti: {HP: 0, 力: 0, 魔力: 1, 技: -1, 速さ: 2, 守備: -1, 魔防: -1, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "フィレネ",
        name: "アルフレッド",
        seityouritu: {HP: 65, 力: 40, 魔力: 5, 技: 35, 速さ: 40, 守備: 40, 魔防: 20, 幸運: 40, 体格: 10, 合計: 295},
        jougenti: {HP: 0, 力: 2, 魔力: -1, 技: 1, 速さ: 0, 守備: 2, 魔防: -2, 幸運: -1, 体格: 0, 合計: 1},
    },
    {
        kuni: "フィレネ",
        name: "セリーヌ",
        seityouritu: {HP: 50, 力: 35, 魔力: 25, 技: 30, 速さ: 45, 守備: 30, 魔防: 40, 幸運: 50, 体格: 5, 合計: 310},
        jougenti: {HP: 0, 力: -2, 魔力: 2, 技: -2, 速さ: 1, 守備: -3, 魔防: 1, 幸運: 3, 体格: 0, 合計: 0},
    },
    {
        kuni: "フィレネ",
        name: "ブシュロン",
        seityouritu: {HP: 85, 力: 20, 魔力: 0, 技: 50, 速さ: 45, 守備: 35, 魔防: 20, 幸運: 15, 体格: 20, 合計: 290},
        jougenti: {HP: 0, 力: 1, 魔力: 0, 技: 2, 速さ: 2, 守備: -2, 魔防: 0, 幸運: -2, 体格: 0, 合計: 1},
    },
    {
        kuni: "フィレネ",
        name: "エーティエ",
        seityouritu: {HP: 45, 力: 40, 魔力: 0, 技: 25, 速さ: 35, 守備: 25, 魔防: 30, 幸運: 25, 体格: 5, 合計: 230},
        jougenti: {HP: 0, 力: 2, 魔力: -2, 技: 2, 速さ: 0, 守備: 0, 魔防: -1, 幸運: -1, 体格: 0, 合計: 0},
    },
    {
        kuni: "フィレネ",
        name: "ルイ",
        seityouritu: {HP: 75, 力: 40, 魔力: 0, 技: 25, 速さ: 25, 守備: 50, 魔防: 20, 幸運: 25, 体格: 15, 合計: 275},
        jougenti: {HP: 0, 力: 1, 魔力: 0, 技: -1, 速さ: -2, 守備: 3, 魔防: -2, 幸運: 1, 体格: 0, 合計: 0},
    },
    {
        kuni: "フィレネ",
        name: "クロエ",
        seityouritu: {HP: 75, 力: 25, 魔力: 35, 技: 40, 速さ: 55, 守備: 30, 魔防: 25, 幸運: 25, 体格: 5, 合計: 315},
        jougenti: {HP: 0, 力: -2, 魔力: 1, 技: 0, 速さ: 3, 守備: -1, 魔防: 0, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "フィレネ",
        name: "ジャン",
        seityouritu: {HP: 50, 力: 20, 魔力: 20, 技: 35, 速さ: 40, 守備: 25, 魔防: 20, 幸運: 25, 体格: 5, 合計: 240},
        jougenti: {HP: 0, 力: 0, 魔力: 2, 技: -1, 速さ: -1, 守備: 0, 魔防: 0, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "ブロディア",
        name: "ディアマンド",
        seityouritu: {HP: 75, 力: 30, 魔力: 15, 技: 20, 速さ: 40, 守備: 40, 魔防: 25, 幸運: 20, 体格: 15, 合計: 280},
        jougenti: {HP: 0, 力: 2, 魔力: -1, 技: -1, 速さ: 0, 守備: 2, 魔防: -1, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "ブロディア",
        name: "スタルーク",
        seityouritu: {HP: 65, 力: 30, 魔力: 10, 技: 40, 速さ: 45, 守備: 30, 魔防: 20, 幸運: 15, 体格: 10, 合計: 265},
        jougenti: {HP: 0, 力: 1, 魔力: -1, 技: 3, 速さ: 0, 守備: 1, 魔防: -2, 幸運: -1, 体格: 0, 合計: 1},
    },
    {
        kuni: "ブロディア",
        name: "アンバー",
        seityouritu: {HP: 65, 力: 45, 魔力: 0, 技: 25, 速さ: 30, 守備: 35, 魔防: 5, 幸運: 35, 体格: 15, 合計: 255},
        jougenti: {HP: 0, 力: 2, 魔力: -1, 技: -1, 速さ: -1, 守備: 1, 魔防: -1, 幸運: 1, 体格: 0, 合計: 0},
    },
    {
        kuni: "ブロディア",
        name: "ジェーデ",
        seityouritu: {HP: 55, 力: 35, 魔力: 25, 技: 35, 速さ: 30, 守備: 40, 魔防: 30, 幸運: 20, 体格: 10, 合計: 280},
        jougenti: {HP: 0, 力: 1, 魔力: -1, 技: 0, 速さ: 0, 守備: 2, 魔防: 0, 幸運: -1, 体格: 0, 合計: 1},
    },
    {
        kuni: "ブロディア",
        name: "ラピス",
        seityouritu: {HP: 55, 力: 25, 魔力: 20, 技: 35, 速さ: 55, 守備: 35, 魔防: 30, 幸運: 25, 体格: 5, 合計: 285},
        jougenti: {HP: 0, 力: -2, 魔力: -2, 技: 2, 速さ: 3, 守備: 0, 魔防: 0, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "ブロディア",
        name: "シトリニカ",
        seityouritu: {HP: 45, 力: 10, 魔力: 40, 技: 25, 速さ: 30, 守備: 20, 魔防: 40, 幸運: 25, 体格: 5, 合計: 240},
        jougenti: {HP: 0, 力: -1, 魔力: 3, 技: 0, 速さ: -1, 守備: -2, 魔防: 2, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "ブロディア",
        name: "ユナカ",
        seityouritu: {HP: 50, 力: 35, 魔力: 25, 技: 40, 速さ: 45, 守備: 15, 魔防: 45, 幸運: 25, 体格: 5, 合計: 285},
        jougenti: {HP: 0, 力: -1, 魔力: 0, 技: 1, 速さ: 2, 守備: -2, 魔防: 2, 幸運: -1, 体格: 0, 合計: 1},
    },
    {
        kuni: "ブロディア",
        name: "ザフィーア",
        seityouritu: {HP: 80, 力: 35, 魔力: 0, 技: 25, 速さ: 30, 守備: 30, 魔防: 5, 幸運: 20, 体格: 10, 合計: 235},
        jougenti: {HP: 0, 力: 2, 魔力: -2, 技: 0, 速さ: 1, 守備: 1, 魔防: -2, 幸運: 0, 体格: 0, 合計: 0},
    },
    {
        kuni: "イルシオン",
        name: "アイビー",
        seityouritu: {HP: 55, 力: 25, 魔力: 30, 技: 25, 速さ: 40, 守備: 30, 魔防: 35, 幸運: 15, 体格: 10, 合計: 265},
        jougenti: {HP: 0, 力: 0, 魔力: 2, 技: -2, 速さ: 0, 守備: 2, 魔防: 2, 幸運: -3, 体格: 0, 合計: 1},
    },
    {
        kuni: "イルシオン",
        name: "オルテンシア",
        seityouritu: {HP: 40, 力: 20, 魔力: 20, 技: 35, 速さ: 50, 守備: 25, 魔防: 55, 幸運: 50, 体格: 0, 合計: 295},
        jougenti: {HP: 0, 力: -2, 魔力: 0, 技: 0, 速さ: 1, 守備: -3, 魔防: 3, 幸運: 2, 体格: 0, 合計: 1},
    },
    {
        kuni: "イルシオン",
        name: "ゼルコバ",
        seityouritu: {HP: 65, 力: 35, 魔力: 15, 技: 40, 速さ: 35, 守備: 35, 魔防: 15, 幸運: 25, 体格: 10, 合計: 275},
        jougenti: {HP: 0, 力: 0, 魔力: -1, 技: 2, 速さ: 0, 守備: 0, 魔防: -1, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "イルシオン",
        name: "カゲツ",
        seityouritu: {HP: 60, 力: 30, 魔力: 15, 技: 50, 速さ: 50, 守備: 40, 魔防: 25, 幸運: 40, 体格: 10, 合計: 320},
        jougenti: {HP: 0, 力: -1, 魔力: -1, 技: 2, 速さ: 2, 守備: 0, 魔防: -2, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "イルシオン",
        name: "ロサード",
        seityouritu: {HP: 75, 力: 45, 魔力: 25, 技: 40, 速さ: 45, 守備: 30, 魔防: 30, 幸運: 20, 体格: 5, 合計: 315},
        jougenti: {HP: 0, 力: 3, 魔力: -2, 技: 1, 速さ: 0, 守備: 1, 魔防: -2, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "イルシオン",
        name: "ゴルドマリー",
        seityouritu: {HP: 65, 力: 30, 魔力: 5, 技: 25, 速さ: 25, 守備: 55, 魔防: 25, 幸運: 25, 体格: 5, 合計: 260},
        jougenti: {HP: 0, 力: 1, 魔力: -3, 技: 0, 速さ: 0, 守備: 2, 魔防: -1, 幸運: 2, 体格: 0, 合計: 1},
    },
    {
        kuni: "イルシオン",
        name: "アンナ",
        seityouritu: {HP: 55, 力: 15, 魔力: 50, 技: 50, 速さ: 50, 守備: 20, 魔防: 35, 幸運: 45, 体格: 5, 合計: 325},
        jougenti: {HP: 0, 力: 0, 魔力: 1, 技: 1, 速さ: 1, 守備: -2, 魔防: -1, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "イルシオン",
        name: "リンデン",
        seityouritu: {HP: 65, 力: 25, 魔力: 25, 技: 25, 速さ: 40, 守備: 25, 魔防: 40, 幸運: 15, 体格: 10, 合計: 270},
        jougenti: {HP: 0, 力: 0, 魔力: 2, 技: -1, 速さ: 0, 守備: -2, 魔防: 2, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "ソルム",
        name: "ミスティラ",
        seityouritu: {HP: 55, 力: 25, 魔力: 25, 技: 45, 速さ: 45, 守備: 30, 魔防: 30, 幸運: 30, 体格: 10, 合計: 295},
        jougenti: {HP: 0, 力: -1, 魔力: -1, 技: 3, 速さ: 0, 守備: 2, 魔防: -3, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "ソルム",
        name: "フォガート",
        seityouritu: {HP: 60, 力: 30, 魔力: 25, 技: 30, 速さ: 55, 守備: 30, 魔防: 35, 幸運: 25, 体格: 10, 合計: 300},
        jougenti: {HP: 0, 力: -1, 魔力: -1, 技: 0, 速さ: 3, 守備: -1, 魔防: 1, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "ソルム",
        name: "メリン",
        seityouritu: {HP: 55, 力: 25, 魔力: 25, 技: 40, 速さ: 50, 守備: 30, 魔防: 30, 幸運: 25, 体格: 10, 合計: 290},
        jougenti: {HP: 0, 力: -1, 魔力: -1, 技: 1, 速さ: 2, 守備: -1, 魔防: 0, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "ソルム",
        name: "パネトネ",
        seityouritu: {HP: 75, 力: 45, 魔力: 10, 技: 40, 速さ: 25, 守備: 30, 魔防: 15, 幸運: 20, 体格: 15, 合計: 275},
        jougenti: {HP: 0, 力: 3, 魔力: -1, 技: 0, 速さ: 0, 守備: 0, 魔防: -1, 幸運: 0, 体格: 0, 合計: 1},
    },
    {
        kuni: "ソルム",
        name: "パンドロ",
        seityouritu: {HP: 60, 力: 5, 魔力: 30, 技: 45, 速さ: 45, 守備: 15, 魔防: 55, 幸運: 30, 体格: 15, 合計: 300},
        jougenti: {HP: 0, 力: -3, 魔力: 2, 技: 0, 速さ: -1, 守備: -2, 魔防: 3, 幸運: 2, 体格: 0, 合計: 1},
    },
    {
        kuni: "ソルム",
        name: "ボネ",
        seityouritu: {HP: 65, 力: 30, 魔力: 10, 技: 40, 速さ: 35, 守備: 45, 魔防: 25, 幸運: 40, 体格: 10, 合計: 300},
        jougenti: {HP: 0, 力: 1, 魔力: -3, 技: 1, 速さ: 0, 守備: 2, 魔防: -1, 幸運: 1, 体格: 0, 合計: 1},
    },
    {
        kuni: "ソルム",
        name: "セアダス",
        seityouritu: {HP: 55, 力: 25, 魔力: 15, 技: 25, 速さ: 50, 守備: 25, 魔防: 25, 幸運: 35, 体格: 10, 合計: 265},
        jougenti: {HP: 0, 力: 0, 魔力: -2, 技: -1, 速さ: 2, 守備: 0, 魔防: 0, 幸運: 2, 体格: 0, 合計: 1},
    },
    {
        kuni: "その他",
        name: "ヴェイル",
        seityouritu: {HP: 40, 力: 25, 魔力: 45, 技: 35, 速さ: 30, 守備: 25, 魔防: 35, 幸運: 20, 体格: 0, 合計: 255},
        jougenti: {HP: 0, 力: 0, 魔力: 3, 技: 0, 速さ: -1, 守備: 0, 魔防: 3, 幸運: -2, 体格: 0, 合計: 3},
    },
    {
        kuni: "その他",
        name: "モーヴ",
        seityouritu: {HP: 70, 力: 35, 魔力: 40, 技: 40, 速さ: 35, 守備: 50, 魔防: 45, 幸運: 15, 体格: 15, 合計: 345},
        jougenti: {HP: 0, 力: 1, 魔力: 2, 技: 1, 速さ: -2, 守備: 1, 魔防: 1, 幸運: -2, 体格: 0, 合計: 2},
    },
    {
        kuni: "DLC",
        name: "エル",
        seityouritu: {HP: 55, 力: 30, 魔力: 25, 技: 40, 速さ: 45, 守備: 30, 魔防: 35, 幸運: 30, 体格: 10, 合計: 300},
        jougenti: {HP: 0, 力: 0, 魔力: 0, 技: 0, 速さ: 0, 守備: 0, 魔防: 0, 幸運: 0, 体格: 0, 合計: 0},
    },
    {
        kuni: "DLC",
        name: "ラファール",
        seityouritu: {HP: 70, 力: 40, 魔力: 10, 技: 40, 速さ: 35, 守備: 45, 魔防: 20, 幸運: 10, 体格: 10, 合計: 280},
        jougenti: {HP: 0, 力: 0, 魔力: 0, 技: 0, 速さ: 0, 守備: 0, 魔防: 0, 幸運: 0, 体格: 0, 合計: 0},
    },
    {
        kuni: "DLC",
        name: "セレスティア",
        seityouritu: {HP: 60, 力: 35, 魔力: 35, 技: 35, 速さ: 50, 守備: 30, 魔防: 35, 幸運: 20, 体格: 5, 合計: 305},
        jougenti: {HP: 0, 力: 0, 魔力: 1, 技: 0, 速さ: 2, 守備: 1, 魔防: 1, 幸運: -3, 体格: 0, 合計: 2},
    },
    {
        kuni: "DLC",
        name: "グレゴリー",
        seityouritu: {HP: 55, 力: 30, 魔力: 50, 技: 20, 速さ: 25, 守備: 35, 魔防: 50, 幸運: 25, 体格: 5, 合計: 295},
        jougenti: {HP: 0, 力: -2, 魔力: 3, 技: -2, 速さ: -2, 守備: 0, 魔防: 3, 幸運: 2, 体格: 0, 合計: 2},
    },
    {
        kuni: "DLC",
        name: "マデリーン",
        seityouritu: {HP: 75, 力: 50, 魔力: 20, 技: 15, 速さ: 15, 守備: 55, 魔防: 25, 幸運: 25, 体格: 10, 合計: 290},
        jougenti: {HP: 0, 力: 3, 魔力: 0, 技: -2, 速さ: -2, 守備: 3, 魔防: -1, 幸運: 0, 体格: 0, 合計: 1},
    },
];

const kihonHeisyuList = [
    {
        name: "ソードマスター",
        isDlc: false,
        seityouritu: {HP: 10, 力: 10, 魔力: 0, 技: 15, 速さ: 20, 守備: 0, 魔防: 15, 幸運: 15, 体格: 0, 合計: 85},
    },
    {
        name: "ブレイブヒーロー",
        isDlc: false,
        seityouritu: {HP: 15, 力: 15, 魔力: 0, 技: 10, 速さ: 15, 守備: 0, 魔防: 10, 幸運: 15, 体格: 0, 合計: 80},
    },
    {
        name: "ハルバーディア",
        isDlc: false,
        seityouritu: {HP: 10, 力: 15, 魔力: 5, 技: 20, 速さ: 10, 守備: 15, 魔防: 5, 幸運: 5, 体格: 0, 合計: 85},
    },
    {
        name: "ロイヤルナイト",
        isDlc: false,
        seityouritu: {HP: 5, 力: 10, 魔力: 15, 技: 15, 速さ: 15, 守備: 5, 魔防: 20, 幸運: 10, 体格: 0, 合計: 95},
    },
    {
        name: "ベルセルク",
        isDlc: false,
        seityouritu: {HP: 30, 力: 30, 魔力: 0, 技: 5, 速さ: 10, 守備: 5, 魔防: 0, 幸運: 0, 体格: 10, 合計: 90},
    },
    {
        name: "ウォーリアー",
        isDlc: false,
        seityouritu: {HP: 25, 力: 20, 魔力: 0, 技: 10, 速さ: 15, 守備: 10, 魔防: 5, 幸運: 0, 体格: 5, 合計: 90},
    },
    {
        name: "スナイパー",
        isDlc: false,
        seityouritu: {HP: 15, 力: 15, 魔力: 0, 技: 30, 速さ: 10, 守備: 10, 魔防: 0, 幸運: 10, 体格: 0, 合計: 90},
    },
    {
        name: "ボウナイト",
        isDlc: false,
        seityouritu: {HP: 10, 力: 10, 魔力: 0, 技: 20, 速さ: 20, 守備: 0, 魔防: 15, 幸運: 15, 体格: 0, 合計: 90},
    },
    {
        name: "ジェネラル",
        isDlc: false,
        seityouritu: {HP: 25, 力: 20, 魔力: 0, 技: 10, 速さ: 0, 守備: 30, 魔防: 0, 幸運: 0, 体格: 10, 合計: 95},
    },
    {
        name: "グレートナイト",
        isDlc: false,
        seityouritu: {HP: 20, 力: 15, 魔力: 0, 技: 15, 速さ: 0, 守備: 25, 魔防: 10, 幸運: 5, 体格: 5, 合計: 95},
    },
    {
        name: "パラディン",
        isDlc: false,
        seityouritu: {HP: 15, 力: 15, 魔力: 0, 技: 10, 速さ: 15, 守備: 15, 魔防: 15, 幸運: 10, 体格: 0, 合計: 95},
    },
    {
        name: "ウルフナイト",
        isDlc: false,
        seityouritu: {HP: 10, 力: 5, 魔力: 0, 技: 15, 速さ: 20, 守備: 5, 魔防: 20, 幸運: 20, 体格: 0, 合計: 95},
    },
    {
        name: "グリフォンナイト",
        isDlc: false,
        seityouritu: {HP: 0, 力: 10, 魔力: 15, 技: 15, 速さ: 20, 守備: 0, 魔防: 15, 幸運: 15, 体格: 0, 合計: 90},
    },
    {
        name: "ドラゴンナイト",
        isDlc: false,
        seityouritu: {HP: 20, 力: 20, 魔力: 0, 技: 10, 速さ: 5, 守備: 20, 魔防: 5, 幸運: 5, 体格: 5, 合計: 90},
    },
    {
        name: "セイジ",
        isDlc: false,
        seityouritu: {HP: 0, 力: 0, 魔力: 30, 技: 5, 速さ: 0, 守備: 0, 魔防: 30, 幸運: 15, 体格: 0, 合計: 80},
    },
    {
        name: "マージナイト",
        isDlc: false,
        seityouritu: {HP: 5, 力: 5, 魔力: 25, 技: 0, 速さ: 5, 守備: 10, 魔防: 25, 幸運: 5, 体格: 0, 合計: 80},
    },
    {
        name: "マスターモンク",
        isDlc: false,
        seityouritu: {HP: 5, 力: 10, 魔力: 20, 技: 0, 速さ: 0, 守備: 15, 魔防: 25, 幸運: 10, 体格: 0, 合計: 85},
    },
    {
        name: "ハイプリースト",
        isDlc: false,
        seityouritu: {HP: 0, 力: 0, 魔力: 25, 技: 0, 速さ: 5, 守備: 0, 魔防: 30, 幸運: 30, 体格: 0, 合計: 90},
    },
    {
        name: "シーフ",
        isDlc: false,
        seityouritu: {HP: 5, 力: 10, 魔力: 0, 技: 20, 速さ: 15, 守備: 15, 魔防: 5, 幸運: 15, 体格: 0, 合計: 85},
    },
    {
        name: "エンチャント",
        isDlc: true,
        seityouritu: {HP: 5, 力: 15, 魔力: 15, 技: 15, 速さ: 10, 守備: 5, 魔防: 5, 幸運: 15, 体格: 5, 合計: 90},
    },
    {
        name: "マージカノン",
        isDlc: true,
        seityouritu: {HP: 15, 力: 10, 魔力: 0, 技: 15, 速さ: 5, 守備: 20, 魔防: 5, 幸運: 10, 体格: 10, 合計: 90},
    },
];

const senyouHeisyuList = [
    {
        name: "神竜ノ王",
        isDlc: false,
        seityouritu: {HP: 10, 力: 10, 魔力: 0, 技: 10, 速さ: 15, 守備: 15, 魔防: 15, 幸運: 10, 体格: 5, 合計: 90},
    },
    {
        name: "アヴニール",
        isDlc: false,
        seityouritu: {HP: 15, 力: 15, 魔力: 0, 技: 5, 速さ: 10, 守備: 25, 魔防: 5, 幸運: 20, 体格: 5, 合計: 100},
    },
    {
        name: "フロラージュ",
        isDlc: false,
        seityouritu: {HP: 5, 力: 10, 魔力: 15, 技: 5, 速さ: 5, 守備: 5, 魔防: 15, 幸運: 20, 体格: 0, 合計: 80},
    },
    {
        name: "スュクセサール",
        isDlc: false,
        seityouritu: {HP: 15, 力: 20, 魔力: 0, 技: 10, 速さ: 15, 守備: 15, 魔防: 0, 幸運: 10, 体格: 5, 合計: 90},
    },
    {
        name: "ティラユール",
        isDlc: false,
        seityouritu: {HP: 10, 力: 10, 魔力: 0, 技: 30, 速さ: 10, 守備: 15, 魔防: 5, 幸運: 5, 体格: 0, 合計: 85},
    },
    {
        name: "リンドブルム",
        isDlc: false,
        seityouritu: {HP: 5, 力: 0, 魔力: 25, 技: 5, 速さ: 0, 守備: 15, 魔防: 25, 幸運: 0, 体格: 0, 合計: 75},
    },
    {
        name: "スレイプニル",
        isDlc: false,
        seityouritu: {HP: 0, 力: 0, 魔力: 20, 技: 15, 速さ: 15, 守備: 0, 魔防: 30, 幸運: 15, 体格: 0, 合計: 95},
    },
    {
        name: "ピッチフォーク",
        isDlc: false,
        seityouritu: {HP: 10, 力: 15, 魔力: 0, 技: 10, 速さ: 10, 守備: 20, 魔防: 5, 幸運: 5, 体格: 5, 合計: 80},
    },
    {
        name: "クピードー",
        isDlc: false,
        seityouritu: {HP: 10, 力: 5, 魔力: 5, 技: 20, 速さ: 20, 守備: 5, 魔防: 20, 幸運: 0, 体格: 0, 合計: 85},
    },
    {
        name: "ダンサー",
        isDlc: false,
        seityouritu: {HP: 5, 力: 10, 魔力: 0, 技: 5, 速さ: 15, 守備: 10, 魔防: 20, 幸運: 20, 体格: 0, 合計: 85},
    },
    {
        name: "邪竜ノ娘(ヴェイル)",
        isDlc: false,
        seityouritu: {HP: 10, 力: 10, 魔力: 25, 技: 10, 速さ: 5, 守備: 10, 魔防: 25, 幸運: 0, 体格: 0, 合計: 95},
    },
    {
        name: "邪竜ノ娘(エル)",
        isDlc: true,
        seityouritu: {HP: 10, 力: 15, 魔力: 10, 技: 10, 速さ: 15, 守備: 15, 魔防: 15, 幸運: 0, 体格: 5, 合計: 95},
    },
    {
        name: "邪竜ノ子",
        isDlc: true,
        seityouritu: {HP: 15, 力: 20, 魔力: 0, 技: 5, 速さ: 5, 守備: 20, 魔防: 10, 幸運: 0, 体格: 10, 合計: 85},
    },
    {
        name: "メリュジーヌ",
        isDlc: true,
        seityouritu: {HP: 10, 力: 10, 魔力: 10, 技: 10, 速さ: 15, 守備: 10, 魔防: 10, 幸運: 0, 体格: 5, 合計: 80},
    },
];

